<details>
<summary>Execution result of "run-all plan" in "aws"</summary>

```terraform
04:52:06.822 INFO   The stack at /github/workspace/aws will be processed in the following order for command plan:
Group 1
- Module management/north-virginia/aws_organization
- Module management/north-virginia/vpc


04:52:07.046 INFO   [management/north-virginia/aws_organization] Downloading Terraform configurations from file:///github/workspace/modules/aws/aws_organization into /github/workspace/aws/management/north-virginia/aws_organization/.terragrunt-cache/4nvNqm3hQHYqU8MXTsGFuPgIyKE/kLn2nKw80j_MBMKRZUlBCyiMAms
04:52:07.046 INFO   [management/north-virginia/vpc] Downloading Terraform configurations from git::https://github.com/terraform-aws-modules/terraform-aws-vpc.git into /github/workspace/aws/management/north-virginia/vpc/.terragrunt-cache/imz023Fez9MTqVLA3D1zXZstqKA/A35GeYiqYDYXDWZftKtd1kkU5ic
04:52:07.371 STDOUT [management/north-virginia/aws_organization] tofu: Initializing the backend...
04:52:07.498 STDOUT [management/north-virginia/vpc] tofu: Initializing the backend...
04:52:07.527 STDOUT [management/north-virginia/aws_organization] tofu: 
04:52:07.527 STDOUT [management/north-virginia/aws_organization] tofu: Successfully configured the backend "s3"! OpenTofu will automatically
04:52:07.527 STDOUT [management/north-virginia/aws_organization] tofu: use this backend unless the backend configuration changes.
04:52:07.583 STDOUT [management/north-virginia/aws_organization] tofu: Initializing provider plugins...
04:52:07.583 STDOUT [management/north-virginia/aws_organization] tofu: - Finding hashicorp/aws versions matching ">= 4.0.0"...
04:52:07.630 STDOUT [management/north-virginia/vpc] tofu: 
04:52:07.630 STDOUT [management/north-virginia/vpc] tofu: Successfully configured the backend "s3"! OpenTofu will automatically
04:52:07.630 STDOUT [management/north-virginia/vpc] tofu: use this backend unless the backend configuration changes.
04:52:07.755 STDOUT [management/north-virginia/vpc] tofu: Initializing provider plugins...
04:52:07.755 STDOUT [management/north-virginia/vpc] tofu: - Finding hashicorp/aws versions matching ">= 5.79.0"...
04:52:07.885 STDOUT [management/north-virginia/aws_organization] tofu: - Installing hashicorp/aws v5.92.0...
04:52:08.221 STDOUT [management/north-virginia/vpc] tofu: - Installing hashicorp/aws v5.92.0...
04:52:12.150 STDOUT [management/north-virginia/aws_organization] tofu: - Installed hashicorp/aws v5.92.0 (signed, key ID 0C0AF313E5FD9F80)
04:52:12.150 STDOUT [management/north-virginia/aws_organization] tofu: Providers are signed by their developers.
04:52:12.150 STDOUT [management/north-virginia/aws_organization] tofu: If you'd like to know more about provider signing, you can read about it here:
04:52:12.150 STDOUT [management/north-virginia/aws_organization] tofu: https://opentofu.org/docs/cli/plugins/signing/
04:52:12.150 STDOUT [management/north-virginia/aws_organization] tofu: OpenTofu has created a lock file .terraform.lock.hcl to record the provider
04:52:12.150 STDOUT [management/north-virginia/aws_organization] tofu: selections it made above. Include this file in your version control repository
04:52:12.150 STDOUT [management/north-virginia/aws_organization] tofu: so that OpenTofu can guarantee to make the same selections by default when
04:52:12.150 STDOUT [management/north-virginia/aws_organization] tofu: you run "tofu init" in the future.
04:52:12.150 STDOUT [management/north-virginia/aws_organization] tofu: OpenTofu has been successfully initialized!
04:52:12.402 STDOUT [management/north-virginia/vpc] tofu: - Installed hashicorp/aws v5.92.0 (signed, key ID 0C0AF313E5FD9F80)
04:52:12.402 STDOUT [management/north-virginia/vpc] tofu: Providers are signed by their developers.
04:52:12.402 STDOUT [management/north-virginia/vpc] tofu: If you'd like to know more about provider signing, you can read about it here:
04:52:12.402 STDOUT [management/north-virginia/vpc] tofu: https://opentofu.org/docs/cli/plugins/signing/
04:52:12.402 STDOUT [management/north-virginia/vpc] tofu: OpenTofu has created a lock file .terraform.lock.hcl to record the provider
04:52:12.402 STDOUT [management/north-virginia/vpc] tofu: selections it made above. Include this file in your version control repository
04:52:12.402 STDOUT [management/north-virginia/vpc] tofu: so that OpenTofu can guarantee to make the same selections by default when
04:52:12.402 STDOUT [management/north-virginia/vpc] tofu: you run "tofu init" in the future.
04:52:12.402 STDOUT [management/north-virginia/vpc] tofu: OpenTofu has been successfully initialized!
04:52:15.259 STDOUT [management/north-virginia/aws_organization] tofu: OpenTofu used the selected providers to generate the following execution
04:52:15.259 STDOUT [management/north-virginia/aws_organization] tofu: plan. Resource actions are indicated with the following symbols:
04:52:15.259 STDOUT [management/north-virginia/aws_organization] tofu:   + create
04:52:15.259 STDOUT [management/north-virginia/aws_organization] tofu: OpenTofu will perform the following actions:
04:52:15.259 STDOUT [management/north-virginia/aws_organization] tofu:   # aws_organizations_organization.org will be created
04:52:15.259 STDOUT [management/north-virginia/aws_organization] tofu:   + resource "aws_organizations_organization" "org" {
04:52:15.259 STDOUT [management/north-virginia/aws_organization] tofu:       + accounts                      = (known after apply)
04:52:15.259 STDOUT [management/north-virginia/aws_organization] tofu:       + arn                           = (known after apply)
04:52:15.259 STDOUT [management/north-virginia/aws_organization] tofu:       + aws_service_access_principals = [
04:52:15.259 STDOUT [management/north-virginia/aws_organization] tofu:           + "cloudtrail.amazonaws.com",
04:52:15.259 STDOUT [management/north-virginia/aws_organization] tofu:           + "config.amazonaws.com",
04:52:15.259 STDOUT [management/north-virginia/aws_organization] tofu:         ]
04:52:15.259 STDOUT [management/north-virginia/aws_organization] tofu:       + feature_set                   = "ALL"
04:52:15.259 STDOUT [management/north-virginia/aws_organization] tofu:       + id                            = (known after apply)
04:52:15.259 STDOUT [management/north-virginia/aws_organization] tofu:       + master_account_arn            = (known after apply)
04:52:15.259 STDOUT [management/north-virginia/aws_organization] tofu:       + master_account_email          = (known after apply)
04:52:15.259 STDOUT [management/north-virginia/aws_organization] tofu:       + master_account_id             = (known after apply)
04:52:15.259 STDOUT [management/north-virginia/aws_organization] tofu:       + master_account_name           = (known after apply)
04:52:15.259 STDOUT [management/north-virginia/aws_organization] tofu:       + non_master_accounts           = (known after apply)
04:52:15.259 STDOUT [management/north-virginia/aws_organization] tofu:       + roots                         = (known after apply)
04:52:15.259 STDOUT [management/north-virginia/aws_organization] tofu:     }
04:52:15.259 STDOUT [management/north-virginia/aws_organization] tofu: Plan: 1 to add, 0 to change, 0 to destroy.
04:52:15.259 STDOUT [management/north-virginia/aws_organization] tofu: 
04:52:15.259 STDOUT [management/north-virginia/aws_organization] tofu: Changes to Outputs:
04:52:15.259 STDOUT [management/north-virginia/aws_organization] tofu:   + organization_arn               = (known after apply)
04:52:15.259 STDOUT [management/north-virginia/aws_organization] tofu:   + organization_id                = (known after apply)
04:52:15.259 STDOUT [management/north-virginia/aws_organization] tofu:   + organization_master_account_id = (known after apply)
04:52:15.260 STDOUT [management/north-virginia/aws_organization] tofu:   + organization_roots             = (known after apply)
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu: Changes to Outputs:
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:   + azs                                         = [
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:       + "eu-west-1a",
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:       + "eu-west-1b",
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:       + "eu-west-1c",
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:     ]
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:   + cgw_arns                                    = []
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:   + cgw_ids                                     = []
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:   + database_nat_gateway_route_ids              = []
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:   + database_route_table_association_ids        = []
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:   + database_route_table_ids                    = []
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:   + database_subnet_arns                        = []
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:   + database_subnet_objects                     = []
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:   + database_subnets                            = []
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:   + database_subnets_cidr_blocks                = []
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:   + database_subnets_ipv6_cidr_blocks           = []
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:   + elasticache_route_table_association_ids     = []
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:   + elasticache_route_table_ids                 = []
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:   + elasticache_subnet_arns                     = []
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:   + elasticache_subnet_objects                  = []
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:   + elasticache_subnets                         = []
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:   + elasticache_subnets_cidr_blocks             = []
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:   + elasticache_subnets_ipv6_cidr_blocks        = []
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:   + intra_route_table_association_ids           = []
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:   + intra_route_table_ids                       = []
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:   + intra_subnet_arns                           = []
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:   + intra_subnet_objects                        = []
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:   + intra_subnets                               = []
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:   + intra_subnets_cidr_blocks                   = []
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:   + intra_subnets_ipv6_cidr_blocks              = []
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:   + name                                        = "my-vpc"
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:   + nat_ids                                     = []
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:   + nat_public_ips                              = []
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:   + natgw_ids                                   = []
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:   + natgw_interface_ids                         = []
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:   + outpost_subnet_arns                         = []
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:   + outpost_subnet_objects                      = []
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:   + outpost_subnets                             = []
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:   + outpost_subnets_cidr_blocks                 = []
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:   + outpost_subnets_ipv6_cidr_blocks            = []
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:   + private_ipv6_egress_route_ids               = []
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:   + private_nat_gateway_route_ids               = []
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:   + private_route_table_association_ids         = []
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:   + private_route_table_ids                     = []
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:   + private_subnet_arns                         = []
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:   + private_subnet_objects                      = []
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:   + private_subnets                             = []
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:   + private_subnets_cidr_blocks                 = []
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:   + private_subnets_ipv6_cidr_blocks            = []
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:   + public_route_table_association_ids          = []
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:   + public_route_table_ids                      = []
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:   + public_subnet_arns                          = []
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:   + public_subnet_objects                       = []
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:   + public_subnets                              = []
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:   + public_subnets_cidr_blocks                  = []
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:   + public_subnets_ipv6_cidr_blocks             = []
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:   + redshift_public_route_table_association_ids = []
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:   + redshift_route_table_association_ids        = []
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:   + redshift_route_table_ids                    = []
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:   + redshift_subnet_arns                        = []
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:   + redshift_subnet_objects                     = []
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:   + redshift_subnets                            = []
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:   + redshift_subnets_cidr_blocks                = []
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:   + redshift_subnets_ipv6_cidr_blocks           = []
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:   + this_customer_gateway                       = {}
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:   + vpc_block_public_access_exclusions          = {}
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:   + vpc_flow_log_cloudwatch_iam_role_arn        = ""
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:   + vpc_flow_log_destination_arn                = ""
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:   + vpc_flow_log_destination_type               = "cloud-watch-logs"
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu:   + vpc_secondary_cidr_blocks                   = []
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu: You can apply this plan to save these new output values to the OpenTofu
04:52:15.748 STDOUT [management/north-virginia/vpc] tofu: state, without changing any real infrastructure.
```

</details>
    
